import sqlite3

# Підключення до бази
conn = sqlite3.connect("milling_data.db")
cursor = conn.cursor()

"""
tables = [
    "A1_feeds",
    "A2_feeds",
    "A3_finishing_feeds",
    "A4_feeds",
    "A5_feeds",
    "A6_cutting_speeds",
    "cutting_speed_coeffs_cu_al",
    "tool_life",
    "A9_speed_exponents",
    "A10_surface_correction",
    "tool_material_coeffs",
    "A12_milling_machines"
]

for table in tables:
    cursor.execute(f"DROP TABLE IF EXISTS {table}")

"""
# Створення таблиць A.4–A.8
create_sql = """

-- Таблиця A.1 – Подачі при чорновому фрезеруванні (твердосплавні фрези)
CREATE TABLE IF NOT EXISTS A1_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    machine_power TEXT,           -- Потужність верстата: "До 10" або "Більше 10"
    material TEXT,                -- Матеріал: "Сталь" або "Чавун та мідні сплави"
    carbide_type TEXT,           -- Твердий сплав: T15K6, T5K10, BK6, BK8
    feed_min REAL,               -- Мінімальна подача на зуб, мм/зуб
    feed_max REAL                -- Максимальна подача на зуб, мм/зуб
);

-- Таблиця A.2 – Подачі при чорновому фрезеруванні (швидкорізальні фрези)
CREATE TABLE IF NOT EXISTS A2_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    machine_power TEXT,          -- Потужність верстата: "До 5", "5–10", "Більше 10"
    tooth_size TEXT,             -- Зуби фрези: "Великі", "Дрібні"
    cutter_type TEXT,            -- Тип фрези: "Торцеві і дискові" або "Циліндрові"
    material TEXT,               -- Матеріал: "Сталь", "Чавун та мідні сплави"
    feed_min REAL,               -- Мінімальна подача, мм/зуб
    feed_max REAL                -- Максимальна подача, мм/зуб
);

-- Таблиця A.3 – Подачі при чистовому фрезеруванні
CREATE TABLE IF NOT EXISTS A3_finishing_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    cutter_type TEXT,
    tool_material TEXT,
    material TEXT,
    diameter_range TEXT,
    feed_min REAL,
    feed_max REAL
);

-- Таблиця A.4
CREATE TABLE IF NOT EXISTS A4_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    cutter_type TEXT,          -- Вид ріжучого елемента: "Коронка" або "Гвинтові пластинки"
    diameter_min INTEGER,      -- Мінімальний діаметр фрези, мм
    diameter_max INTEGER,      -- Максимальний діаметр фрези, мм
    depth_min INTEGER,         -- Мінімальна глибина фрезерування, мм
    depth_max INTEGER,         -- Максимальна глибина фрезерування, мм
    feed_min REAL,             -- Мінімальна подача на зуб, мм/зуб
    feed_max REAL              -- Максимальна подача на зуб, мм/зуб
);

-- Таблиця A.5
CREATE TABLE IF NOT EXISTS A5_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    diameter_min INTEGER,    -- Мінімальний діаметр фрези, мм
    diameter_max INTEGER,    -- Максимальний діаметр фрези, мм
    feed_min REAL,           -- Мінімальна подача, мм/об
    feed_max REAL            -- Максимальна подача, мм/об
);

-- Таблиця A.6 (структура для сталей і чавунів)
CREATE TABLE IF NOT EXISTS A6_cutting_speeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    material_type TEXT,
    hardness TEXT,
    cutter_type TEXT,
    tool_material TEXT,
    operation TEXT,
    B TEXT,
    t TEXT,
    s TEXT,
    Cv REAL,
    q REAL,
    x REAL,
    y REAL,
    u REAL,
    p REAL,
    m REAL
);

-- Таблиця A.7 (мідні й алюмінієві сплави)
CREATE TABLE IF NOT EXISTS cutting_speed_A7 (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    tool_type TEXT,
    material TEXT,
    sz TEXT,
    Cv REAL,
    q REAL,
    x REAL,
    y REAL,
    u REAL,
    p REAL,
    m REAL
);

-- Таблиця A.8
CREATE TABLE IF NOT EXISTS tool_life (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    tool_type TEXT,
    diameter_min INTEGER,
    diameter_max INTEGER,
    life_minutes INTEGER
);

-- A.9: Показники ступеня nv
CREATE TABLE IF NOT EXISTS A9_speed_exponents (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    material TEXT,
    condition TEXT,
    milling_hss REAL,
    milling_carbide REAL
);

-- A.10: Поправкові коефіцієнти Knv (стан поверхні)
CREATE TABLE IF NOT EXISTS A10_surface_correction (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    surface_condition TEXT,
    material TEXT,
    Ksh_min REAL,
    Ksh_max REAL
);

-- A.11: Поправкові коефіцієнти Kuv
CREATE TABLE IF NOT EXISTS tool_material_coeffs (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    material TEXT,
    coeff REAL
);

-- A.12: Верстати
CREATE TABLE IF NOT EXISTS A12_milling_machines (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    model TEXT,
    type TEXT,
    table_size TEXT,
    spindle_speed_steps INTEGER,
    spindle_speed_min INTEGER,
    spindle_speed_max INTEGER,
    feed_steps INTEGER,
    longitudinal_feed_min REAL,
    longitudinal_feed_max REAL,
    cross_feed_min REAL,
    cross_feed_max REAL,
    feed_force REAL,
    motor_power REAL,
    efficiency REAL
);
"""


cursor.executescript(create_sql)

# 🔢 Дані для A.1
data_a1 = [
    ("<10", "Сталь", "T15K6", 0.09, 0.18),
    ("<10", "Сталь", "T5K10", 0.12, 0.18),
    ("<10", "Чавун та мідні сплави", "BK6", 0.14, 0.24),
    ("<10", "Чавун та мідні сплави", "BK8", 0.20, 0.29),
    (">10", "Сталь", "T15K6", 0.12, 0.18),
    (">10", "Сталь", "T5K10", 0.16, 0.24),
    (">10", "Чавун та мідні сплави", "BK6", 0.18, 0.28),
    (">10", "Чавун та мідні сплави", "BK8", 0.25, 0.38),
]

# Заповнення таблиці даними
cursor.executemany("""
INSERT INTO A1_feeds (machine_power, material, carbide_type, feed_min, feed_max)
VALUES (?, ?, ?, ?, ?)
""", data_a1)

# 🔢 Дані для A.2
data_a2 = [
    # До 5 кВт
    ("<5", "Великі", "Торцеві і дискові", "Сталь", 0.06, 0.07),
    ("<5", "Великі", "Торцеві і дискові", "Чавун та мідні сплави", 0.15, 0.30),
    ("<5", "Дрібні", "Торцеві і дискові", "Сталь", 0.04, 0.06),
    ("<5", "Дрібні", "Торцеві і дискові", "Чавун та мідні сплави", 0.12, 0.20),
    ("<5", "Великі", "Циліндрові", "Сталь", 0.08, 0.12),
    ("<5", "Великі", "Циліндрові", "Чавун та мідні сплави", 0.10, 0.18),
    ("<5", "Дрібні", "Циліндрові", "Сталь", 0.05, 0.08),
    ("<5", "Дрібні", "Циліндрові", "Чавун та мідні сплави", 0.06, 0.12),

    # 5–10 кВт
    ("5-10", "Великі", "Торцеві і дискові", "Сталь", 0.08, 0.15),
    ("5-10", "Великі", "Торцеві і дискові", "Чавун та мідні сплави", 0.20, 0.40),
    ("5-10", "Дрібні", "Торцеві і дискові", "Сталь", 0.06, 0.10),
    ("5-10", "Дрібні", "Торцеві і дискові", "Чавун та мідні сплави", 0.15, 0.30),
    ("5-10", "Великі", "Циліндрові", "Сталь", 0.12, 0.20),
    ("5-10", "Великі", "Циліндрові", "Чавун та мідні сплави", 0.20, 0.30),
    ("5-10", "Дрібні", "Циліндрові", "Сталь", 0.10, 0.15),
    ("5-10", "Дрібні", "Циліндрові", "Чавун та мідні сплави", 0.15, 0.25),

    # Більше 10 кВт
    (">10", "Великі", "Торцеві і дискові", "Сталь", 0.15, 0.25),
    (">10", "Великі", "Торцеві і дискові", "Чавун та мідні сплави", 0.30, 0.50),
    (">10", "Великі", "Циліндрові", "Сталь", 0.30, 0.40),
    (">10", "Великі", "Циліндрові", "Чавун та мідні сплави", 0.40, 0.60),
    (">10", "Дрібні", "Торцеві і дискові", "Сталь", 0.15, 0.25),
    (">10", "Дрібні", "Торцеві і дискові", "Чавун та мідні сплави", 0.30, 0.50),
    (">10", "Дрібні", "Циліндрові", "Сталь", 0.30, 0.40),
    (">10", "Дрібні", "Циліндрові", "Чавун та мідні сплави", 0.40, 0.60),
]

# Додавання в таблицю
cursor.executemany("""
INSERT INTO A2_feeds (machine_power, tooth_size, cutter_type, material, feed_min, feed_max)
VALUES (?, ?, ?, ?, ?, ?)
""", data_a2)

# 🔢 Дані для A.3
data_a3 = [
    # Торцеві і дискові фрези зі вставними ножами
    ("Торцеві і дискові", "Твердий сплав", None, None, 0.4, 1.2),
    ("Торцеві і дискові", "Швидкорізальна сталь", None, None, 0.23, 1.2),

    # Циліндрові фрези зі швидкорізальної сталі, конструкційна сталь
    ("Циліндрові фрези", None, "Конструкційна сталь", "40-75", 0.6, 2.7),
    ("Циліндрові фрези", None, "Конструкційна сталь", "90-130", 1.0, 3.8),
    ("Циліндрові фрези", None, "Конструкційна сталь", "150-200", 1.3, 5.0),

    # Циліндрові фрези зі швидкорізальної сталі, чавун, мідні та алюмінієві сплави
    ("Циліндрові фрези", None, "Чавун, мідні та алюмінієві сплави", "40-75", 0.6, 2.3),
    ("Циліндрові фрези", None, "Чавун, мідні та алюмінієві сплави", "90-130", 0.8, 3.0),
    ("Циліндрові фрези", None, "Чавун, мідні та алюмінієві сплави", "150-200", 1.1, 3.7),
]

# Додавання даних
cursor.executemany("""
INSERT INTO A3_finishing_feeds (cutter_type, tool_material, material, diameter_range, feed_min, feed_max)
VALUES (?, ?, ?, ?, ?, ?)
""", data_a3)

# ===== Таблиця A.4 — feeds_endmill_rough =====
data_a4 = [
    # Коронка
    ("Коронка", 10, 13, 0, 3, 0.01, 0.03),
    ("Коронка", 14, 17, 0, 3, 0.02, 0.06),
    ("Коронка", 14, 17, 3, 5, 0.02, 0.04),
    ("Коронка", 18, 22, 0, 3, 0.04, 0.07),
    ("Коронка", 18, 22, 3, 5, 0.03, 0.05),
    ("Коронка", 18, 22, 5, 8, 0.02, 0.04),

    # Гвинтові пластинки
    ("Гвинтові пластинки", 20, 24, 0, 3, 0.06, 0.10),
    ("Гвинтові пластинки", 20, 24, 3, 5, 0.05, 0.08),
    ("Гвинтові пластинки", 20, 24, 5, 8, 0.03, 0.05),

    ("Гвинтові пластинки", 25, 29, 0, 3, 0.08, 0.12),
    ("Гвинтові пластинки", 25, 29, 3, 5, 0.06, 0.10),
    ("Гвинтові пластинки", 25, 29, 5, 8, 0.05, 0.10),
    ("Гвинтові пластинки", 25, 29, 8, 12, 0.05, 0.08),

    ("Гвинтові пластинки", 30, 39, 0, 3, 0.10, 0.15),
    ("Гвинтові пластинки", 30, 39, 3, 5, 0.08, 0.12),
    ("Гвинтові пластинки", 30, 39, 5, 8, 0.06, 0.10),
    ("Гвинтові пластинки", 30, 39, 8, 12, 0.05, 0.09),
    ("Гвинтові пластинки", 30, 39, 12, 20, 0.04, 0.07),

    ("Гвинтові пластинки", 40, 49, 0, 3, 0.10, 0.18),
    ("Гвинтові пластинки", 40, 49, 3, 5, 0.08, 0.13),
    ("Гвинтові пластинки", 40, 49, 5, 8, 0.06, 0.11),
    ("Гвинтові пластинки", 40, 49, 8, 12, 0.05, 0.10),
    ("Гвинтові пластинки", 40, 49, 12, 20, 0.05, 0.09),

    ("Гвинтові пластинки", 50, 50, 0, 3, 0.10, 0.20),
    ("Гвинтові пластинки", 50, 50, 3, 5, 0.10, 0.15),
    ("Гвинтові пластинки", 50, 50, 5, 8, 0.08, 0.12),
    ("Гвинтові пластинки", 50, 50, 8, 12, 0.06, 0.10),
    ("Гвинтові пластинки", 50, 50, 12, 20, 0.06, 0.10),
]

# Додавання даних у таблицю
cursor.executemany("""
INSERT INTO A4_feeds (cutter_type, diameter_min, diameter_max, depth_min, depth_max, feed_min, feed_max)
VALUES (?, ?, ?, ?, ?, ?, ?)
""", data_a4)



# 🔢 Дані з таблиці A.5
data_a5 = [
    (10, 19, 0.02, 0.06),
    (20, 24, 0.06, 0.12),
    (25, 39, 0.12, 0.24),
    (40, 60, 0.30, 0.60),
]

# Додавання в базу
cursor.executemany("""
INSERT INTO A5_feeds (diameter_min, diameter_max, feed_min, feed_max)
VALUES (?, ?, ?, ?)
""", data_a5)

# ===== Таблиця A.6 — cutting_speed_coeffs_steel =====
data_a6 = [
    ("Сталь", None, "Торцева", "Твердий сплав", "Фрезерування площин", None, None, None, 332, 0.25, 0.1, 0.2, 0.15, 0, 0.3),
    ("Сталь", None, "Торцева", "Швидкорізальна сталь", "Фрезерування площин", None, "<0.1", None, 64.7, 0.25, 0.1, 0.2, 0.15, 0, 0.3),
    ("Сталь", None, "Торцева", "Швидкорізальна сталь", "Фрезерування площин", None, ">0.1", None, 41.0, 0.25, 0.1, 0.2, 0.1, 0, 0.33),
    ("Сталь", None, "Циліндрична", "Твердий сплав", "Фрезерування площин", "<35", None, None, 390, 0.17, 0.19, 0.28, -0.05, 0.1, 0.33),
    ("Сталь", None, "Циліндрична", "Твердий сплав", "Фрезерування площин", ">35", None, None, 443, 0.17, 0.19, 0.38, -0.05, 0.1, 0.33),
    ("Сталь", None, "Циліндрична", "Швидкорізальна сталь", "Фрезерування площин", "<2", None, None, 616, 0.17, 0.19, 0, -0.08, 0.08, 0.33),
    ("Сталь", None, "Циліндрична", "Швидкорізальна сталь", "Фрезерування площин", ">2", None, None, 700, 0.38, 0, 0, 0, 0, 0.33),
    ("Сталь", None, "Дискова зі вставними ножами", "Твердий сплав", "Фрезерування площин", None, "<0.12", None, 1340, 0.2, 0.4, 0.12, 0, 0, 0.35),
    ("Сталь", None, "Дискова зі вставними ножами", "Твердий сплав", "Фрезерування площин", None, ">0.12", None, 740, 0, 0.4, 0, 0, 0, 0.35),
    ("Сталь", None, "Дискова зі вставними ножами", "Швидкорізальна сталь", "Фрезерування пазів", None, "<0.06", None, 1825, 0.2, 0.3, 0.12, 0.1, 0, 0.35),
    ("Сталь", None, "Дискова зі вставними ножами", "Швидкорізальна сталь", "Фрезерування пазів", None, ">0.06", None, 690, 0, 0.4, 0, 0, 0, 0.35),
    ("Сталь", None, "Дискова", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, "<0.1", None, 75.5, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Сталь", None, "Дискова", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, ">0.1", None, 48.5, 0, 0.4, 0, 0.1, 0.1, 0.2),
    ("Сталь", None, "Дискова", "Твердий сплав", "Фрезерування площин", None, None, None, 68.5, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Сталь", None, "Кінцева з коронками", "Швидкорізальна сталь", "Фрезерування площин, уступів і пазів", None, None, None, 145, 0.44, 0.24, 0.26, 0.1, 0.13, 0.37),
    ("Сталь", None, "Кінцева з коронками", "Твердий сплав", "Фрезерування площин, уступів і пазів", None, None, None, 145, 0.44, 0.24, 0.26, 0.1, 0.13, 0.37),
    ("Сталь", None, "Кінцева з напаяними пластинами", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, None, None, 234, 0.44, 0.24, 0.26, 0.1, 0.13, 0.37),
    ("Сталь", None, "Кінцева з напаяними пластинами", "Твердий сплав", "Фрезерування площин і пазів", None, None, None, 234, 0.44, 0.24, 0.26, 0.1, 0.13, 0.37),
    ("Сталь", None, "Кінцева", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, None, None, 46.7, 0.45, 0.5, 0.5, 0.1, 0.1, 0.33),
    ("Сталь", None, "Кінцева", "Твердий сплав", "Фрезерування площин і пазів", None, None, None, 46.7, 0.45, 0.5, 0.5, 0.1, 0.1, 0.33),
    ("Чавун", "HB<1500", "Торцева", "Твердий сплав", "Фрезерування поверхонь", None, "<0.18", None, 994, 0.22, 0.17, 0.1, 0.22, 0, 0.33),
    ("Чавун", "HB<1500", "Торцева", "Твердий сплав", "Фрезерування поверхонь", None, ">0.18", None, 695, 0.22, 0.32, 0, 0, 0, 0.33),
    ("Чавун", "HB<1500", "Торцева", "Швидкорізальна сталь", "Фрезерування поверхонь", None, "<0.1", None, 90.5, 0.25, 0.1, 0.2, 0.15, 0.1, 0.2),
    ("Чавун", "HB<1500", "Торцева", "Швидкорізальна сталь", "Фрезерування поверхонь", None, ">0.1", None, 57.4, 0.25, 0, 0.4, 0, 0.1, 0.2),
    ("Чавун", "HB<1500", "Циліндрична", "Швидкорізальна сталь", "Фрезерування поверхонь", None, "<0.1", None, 77, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("Чавун", "HB<1500", "Циліндрична", "Швидкорізальна сталь", "Фрезерування поверхонь", None, ">0.1", None, 49.5, 0.45, 0, 0.4, 0, 0.1, 0.33),
    ("Чавун", "HB<1500", "Дискова", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, None, None, 95.8, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Чавун", "HB<1500", "Дискова", "Твердий сплав", "Фрезерування площин і пазів", None, None, None, 95.8, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Чавун", "HB<1500", "Кінцева", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, None, None, 68.5, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("Чавун", "HB>1500", "Торцева", "Твердий сплав", "Фрезерування поверхонь", None, None, None, 445, 0.2, 0.15, 0.35, 0.2, 0, 0.32),
    ("Чавун", "HB>1500", "Торцева", "Швидкорізальна сталь", "Фрезерування поверхонь", None, None, None, 42, 0.2, 0.1, 0.4, 0.1, 0.1, 0.15),
    ("Чавун", "HB>1500", "Циліндрична", "Твердий сплав", "Фрезерування поверхонь", None, "<2.5", "<0.2", 923, 0.37, 0.13, 0.19, 0.23, 0.14, 0.42),
    ("Чавун", "HB>1500", "Циліндрична", "Твердий сплав", "Фрезерування поверхонь", None, "<2.5", ">0.2", 588, 0.47, 0, 0, 0, 0, 0.42),
    ("Чавун", "HB>1500", "Циліндрична", "Твердий сплав", "Фрезерування поверхонь", None, ">2.5", "<0.2", 1180, 0.37, 0.4, 0.19, 0, 0, 0.42),
    ("Чавун", "HB>1500", "Циліндрична", "Твердий сплав", "Фрезерування поверхонь", None, ">2.5", ">0.2", 750, 0.47, 0, 0, 0, 0, 0.42),
    ("Чавун", "HB>1500", "Циліндрична", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, "<0.15", None, 56.7, 0.7, 0.5, 0.2, 0.3, 0.3, 0.25),
    ("Чавун", "HB>1500", "Циліндрична", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, ">0.15", None, 27, 0.6, 0, 0, 0, 0, 0.15),
    ("Чавун", "HB>1500", "Дискова", "Швидкорізальна сталь", "Фрезерування площин і уступів", None, None, None, 72, 0.2, 0.5, 0.4, 0.1, 0.1, 0.15),
    ("Чавун", "HB>1500", "Дискова", "Твердий сплав", "Фрезерування площин і уступів", None, None, None, 72, 0.2, 0.5, 0.4, 0.1, 0.1, 0.15),
    ("Чавун", "HB>1500", "Кінцева", "Швидкорізальна сталь", "Фрезерування площин і уступів", None, None, None, 72, 0.2, 0.5, 0.4, 0.1, 0.1, 0.15),
    ("Чавун", "HB>1500", "Кінцева", "Твердий сплав", "Фрезерування площин і уступів", None, None, None, 72, 0.2, 0.5, 0.4, 0.1, 0.1, 0.15),
]

# Додавання в таблицю
cursor.executemany("""
INSERT INTO A6_cutting_speeds (
    material_type, hardness, cutter_type, tool_material, operation,
    B, t, s, Cv, q, x, y, u, p, m
) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
""", data_a6)


# 🔢 Дані з таблиці A.7 (cutting_speed_coeffs_cu_al)
data_a7 = [
    ("Торцева", "Мідь", "<0,1", 136, 0.25, 0.1, 0.2, 0.15, 0.1, 0.2),
    ("Торцева", "Мідь", ">0,1", 86.2, 0.25, 0.1, 0.4, 0.15, 0.1, 0.2),
    ("Торцева", "Алюміній", "<0,1", 245, 0.25, 0.1, 0.2, 0.15, 0.1, 0.2),
    ("Торцева", "Алюміній", ">0,1", 155, 0.25, 0.1, 0.4, 0.15, 0.1, 0.2),
    ("Циліндрична", "Мідь", "<0,1", 115.5, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("Циліндрична", "Алюміній", "<0,1", 208, 0.45, 0.3, 0.4, 0.1, 0.1, 0.33),
    ("Циліндрична", "Алюміній", ">0,1", 133.5, 0.45, 0.3, 0.4, 0.1, 0.1, 0.33),
    ("Дискова", "Мідь", None, 144, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Дискова", "Алюміній", None, 259, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Кінцева", "Мідь", None, 103, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("Кінцева", "Алюміній", None, 185.5, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
]

cursor.executemany("""
INSERT INTO cutting_speed_A7 (
    tool_type, material, sz, Cv, q, x, y, u, p, m)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
""", data_a7)


# ===== Таблиця A.8 — tool_life =====
data_a8 = [
    ("Торцева", 40, 59, 120),
    ("Торцева", 60, 74, 180),
    ("Торцева", 75, 89, 180),
    ("Торцева", 90, 109, 180),
    ("Торцева", 110, 149, 180),
    ("Торцева", 150, 199, 180),
    ("Торцева", 200, 249, 240),
    ("Торцева", 250, 299, 240),
    ("Торцева", 300, 399, 300),
    ("Торцева", 400, 400, 400),
    ("Циліндрична", 90, 109, 180),
    ("Циліндрична", 110, 149, 180),
    ("Циліндрична", 150, 199, 180),
    ("Циліндрична", 200, 200, 240),
    ("Циліндрична з малим зубом", 40, 59, 120),
    ("Циліндрична з малим зубом", 60, 74, 120),
    ("Циліндрична з малим зубом", 75, 89, 180),
    ("Циліндрична з малим зубом", 90, 90, 180),
    ("Дискова", 90, 109, 120),
    ("Дискова", 110, 149, 120),
    ("Дискова", 150, 199, 150),
    ("Дискова", 200, 249, 180),
    ("Дискова", 250, 250, 240),
    ("Кінцева", 20, 24, 80),
    ("Кінцева", 25, 39, 90),
    ("Кінцева", 40, 59, 120),
    ("Кінцева", 60, 74, 180),
    ("Прорізна", 75, 89, 60),
    ("Прорізна", 90, 90, 75),
    ("Прорізна", 60, 109, 120),
    ("Прорізна", 110, 149, 120),
    ("Прорізна", 150, 199, 120),
    ("Прорізна", 200, 199, 150),
]

cursor.executemany("""
INSERT INTO tool_life (tool_type, diameter_min, diameter_max, life_minutes)
VALUES (?, ?, ?, ?)
""", data_a8)

# ===== Таблиця A.9 — power_exponents_nv =====
data_a9 = [
    ("Сталь (C<0.6%)", "None", -0.9, 1.0),
    ("Сталь (C>0.6%)", "None", 1.35, 1.0),
    ("Сталь (C>0.6%)", "Хромонікелева", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромомарганцевиста", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромокремниста", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромокремнемарганцевиста", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромонікельмолібденова", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромованадієва", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Марганцевиста", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромонікельванадієва", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромомолібденова", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромоалюмінієва", 1.0, 1.0),
    ("Сталь (C>0.6%)", "Хромонікельванадієва", 1.0, 1.0),
    ("Чавун", "Сірий", 0.95, 1.25),
    ("Чавун", "Ковкий", 0.85, 1.25),
]

cursor.executemany("""
INSERT INTO A9_speed_exponents (
    material, condition, milling_hss, milling_carbide
) VALUES (?, ?, ?, ?)
""", data_a9)

# Дані A.10
data_a10 = [
    ("Без кірки", "Прокат", 1.0, 1.0),
    ("З кіркою", "Прокат", 0.9, 0.9),
    ("З кіркою", "Поковка", 0.8, 0.8),
    ("З кіркою", "Сталь чавун відливання (нормальний стан)", 0.8, 0.85),
    ("З кіркою", "Сталь чавун відливання (забруднений стан)", 0.5, 0.6),
    ("З кіркою", "Мідні й алюмінієві сплави", 0.9, 0.9)
]

cursor.executemany("""
INSERT INTO A10_surface_correction (surface_condition, material, Ksh_min, Ksh_max
) VALUES (?, ?, ?, ?)
""", data_a10)

# Дані A.11
data_a11 = [
    ("Сталь конструкційна Т5К12В", 0.75),
    ("Сталь конструкційна Т5К10", 0.65),
    ("Сталь конструкційна P18", 0.80),
    ("Сталь конструкційна Т15К6", 1.05),
    ("Сталь конструкційна Р6М5", 1.15),
    ("Сталь конструкційна Т30К4", 1.40),
    ("Сталь конструкційна ВК8", 0.40),
    ("Сталь загартована Т15К6 HRC 35-50", 1.0),
    ("Сталь загартована Т30К4 HRC 35-50", 1.25),
    ("Сталь загартована ВК6 HRC 35-50", 0.85),
    ("Сталь загартована ВК8 HRC 35-50", 0.83),
    ("Сталь загартована ВК4 HRC 51-62", 1.0),
    ("Сталь загартована ВК6 HRC 51-62", 0.92),
    ("Сталь загартована ВК8 HRC 51-62", 0.74),
    ("Чавун ВК8 HRC 35-50", 0.83),
    ("Чавун ВК6 HRC 35-50", 1.0),
    ("Чавун ВК4 HRC 35-50", 1.10),
    ("Чавун ВК3 HRC 35-50", 1.15),
    ("Чавун Р18 HRC 51-62", 0.95),
    ("Чавун Р6М3 HRC 51-62", 0.90),
    ("Мідь Р6М5 HRC 35-50", 1.0),
    ("Мідь ВК4 HRC 35-50", 2.5),
    ("Мідь ВК6 HRC 35-50", 2.7),
    ("Мідь 9ХС HRC 35-50", 0.6),
    ("Мідь ХВГ HRC 51-62", 0.6),
    ("Мідь У12А HRC 51-62", 0.5),
    ("Алюміній Р6М5 HRC 35-50", 1.0),
    ("Алюміній ВК4 HRC 35-50", 2.5),
    ("Алюміній ВК6 HRC 35-50", 2.7),
    ("Алюміній 9ХС HRC 35-50", 0.6),
    ("Алюміній ХВГ HRC 51-62", 0.6),
    ("Алюміній У12А HRC 51-62", 0.5),
]

cursor.executemany("""
INSERT INTO tool_material_coeffs (material, coeff)
VALUES (?, ?)
""", data_a11)

# Дані A.12
data_a12 = [
    ("6М81Г", "Горизонтальний", "250×1000", 18, 40, 2000, 18, 20, 1000, 6.5, 333, 1200, 4.0, 0.80),
    ("6Н81Г", "Горизонтальний", "250×1000", 16, 65, 1800, 16, 35, 980, 25, 765, 1200, 4.5, 0.80),
    ("6М82Г", "Горизонтальний", "350×1250", 18, 31, 1600, 18, 25, 1250, 8.3, 416, 1500, 7.5, 0.75),
    ("6Р83", "Горизонтальний", "400×1600", 18, 31.5, 1600, 18, 25, 1250, 25, 1250, 1600, 11.0, 0.75),
    ("6М12П", "Вертикальний", "320×1250", 18, 31, 1600, 18, 25, 1250, 15.6, 785, 1600, 7.5, 0.75),
    ("6М12ПБ", "Вертикальний", "320×1250", 18, 50, 2500, 18, 40, 2000, 27, 1330, 1600, 10.5, 0.75),
    ("6П11", "Вертикальний", "250×1000", 16, 50, 1600, 16, 35, 1020, 35, 1020, 1500, 5.5, 0.75),
    ("6П10", "Вертикальний", "160×630", 12, 50, 2240, 12, 25, 1120, 25, 1120, 1200, 3.0, 0.75),
]

cursor.executemany('''
INSERT INTO A12_milling_machines (
    model, type, table_size, spindle_speed_steps,
    spindle_speed_min, spindle_speed_max, feed_steps,
    longitudinal_feed_min, longitudinal_feed_max,
    cross_feed_min, cross_feed_max,
    feed_force, motor_power, efficiency
) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
''', data_a12)

conn.commit()
conn.close()
