import sqlite3

# Підключення до бази
conn = sqlite3.connect("milling_data.db")
cursor = conn.cursor()

"""
tables = [
    "A1_feeds",
    "A2_feeds",
    "A3_finishing_feeds",
    "A4_feeds",
    "A5_feeds",
    "A6_cutting_speeds",
    "cutting_speed_coeffs_cu_al",
    "tool_life",
    "A9_speed_exponents",
    "A10_surface_correction",
    "tool_material_coeffs",
    "A12_milling_machines"
]

for table in tables:
    cursor.execute(f"DROP TABLE IF EXISTS {table}")
"""

# Створення таблиць A.4–A.8
create_sql = """

-- Таблиця A.1 – Подачі при чорновому фрезеруванні (твердосплавні фрези)
CREATE TABLE IF NOT EXISTS A1_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    machine_power TEXT,           -- Потужність верстата: "До 10" або "Більше 10"
    material TEXT,                -- Матеріал: "Сталь" або "Чавун та мідні сплави"
    carbide_type TEXT,           -- Твердий сплав: T15K6, T5K10, BK6, BK8
    feed_min REAL,               -- Мінімальна подача на зуб, мм/зуб
    feed_max REAL                -- Максимальна подача на зуб, мм/зуб
);

-- Таблиця A.2 – Подачі при чорновому фрезеруванні (швидкорізальні фрези)
CREATE TABLE IF NOT EXISTS A2_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    machine_power TEXT,          -- Потужність верстата: "До 5", "5–10", "Більше 10"
    tooth_size TEXT,             -- Зуби фрези: "Великі", "Дрібні"
    cutter_type TEXT,            -- Тип фрези: "Торцеві і дискові" або "Циліндрові"
    material TEXT,               -- Матеріал: "Сталь", "Чавун та мідні сплави"
    feed_min REAL,               -- Мінімальна подача, мм/зуб
    feed_max REAL                -- Максимальна подача, мм/зуб
);

-- Таблиця A.3 – Подачі при чистовому фрезеруванні
CREATE TABLE IF NOT EXISTS A3_finishing_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    cutter_type TEXT,
    tool_material TEXT,
    material TEXT,
    diameter_range TEXT,
    feed_min REAL,
    feed_max REAL
);

-- Таблиця A.4
CREATE TABLE IF NOT EXISTS A4_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    cutter_type TEXT,          -- Вид ріжучого елемента: "Коронка" або "Гвинтові пластинки"
    diameter_min INTEGER,      -- Мінімальний діаметр фрези, мм
    diameter_max INTEGER,      -- Максимальний діаметр фрези, мм
    depth_min INTEGER,         -- Мінімальна глибина фрезерування, мм
    depth_max INTEGER,         -- Максимальна глибина фрезерування, мм
    feed_min REAL,             -- Мінімальна подача на зуб, мм/зуб
    feed_max REAL              -- Максимальна подача на зуб, мм/зуб
);

-- Таблиця A.5
CREATE TABLE IF NOT EXISTS A5_feeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    diameter_min INTEGER,    -- Мінімальний діаметр фрези, мм
    diameter_max INTEGER,    -- Максимальний діаметр фрези, мм
    feed_min REAL,           -- Мінімальна подача, мм/об
    feed_max REAL            -- Максимальна подача, мм/об
);

-- Таблиця A.6 (структура для сталей і чавунів)
CREATE TABLE IF NOT EXISTS A6_cutting_speeds (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    material_type TEXT,
    hardness TEXT,
    cutter_type TEXT,
    tool_material TEXT,
    operation TEXT,
    B TEXT,
    t TEXT,
    s TEXT,
    Cv REAL,
    q REAL,
    x REAL,
    y REAL,
    u REAL,
    p REAL,
    m REAL
);

-- Таблиця A.7 (мідні й алюмінієві сплави)
CREATE TABLE IF NOT EXISTS cutting_speed_coeffs_cu_al (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    tool_type TEXT,
    material TEXT,
    sz TEXT,
    Cv REAL,
    q REAL,
    x REAL,
    y REAL,
    u REAL,
    p REAL,
    m REAL
);

-- Таблиця A.8
CREATE TABLE IF NOT EXISTS tool_life (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    tool_type TEXT,
    diameter INTEGER,
    life_minutes INTEGER
);

-- A.9: Показники ступеня nv
CREATE TABLE IF NOT EXISTS A9_speed_exponents (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    material TEXT,
    condition TEXT,
    milling_hss REAL,
    milling_carbide REAL
);

-- A.10: Поправкові коефіцієнти Knv (стан поверхні)
CREATE TABLE IF NOT EXISTS A10_surface_correction (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    surface_condition TEXT,
    material TEXT,
    Ksh_min REAL,
    Ksh_max REAL
);

-- A.11: Поправкові коефіцієнти Kuv
CREATE TABLE IF NOT EXISTS tool_material_coeffs (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    workpiece_material TEXT,
    tool_material TEXT,
    coeff REAL
);

-- A.12: Верстати
CREATE TABLE IF NOT EXISTS A12_milling_machines (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    model TEXT,
    type TEXT,
    table_size TEXT,
    spindle_speed_steps INTEGER,
    spindle_speed_min INTEGER,
    spindle_speed_max INTEGER,
    feed_steps INTEGER,
    longitudinal_feed_min REAL,
    longitudinal_feed_max REAL,
    cross_feed_min REAL,
    cross_feed_max REAL,
    feed_force REAL,
    motor_power REAL,
    efficiency REAL
);
"""


cursor.executescript(create_sql)

# 🔢 Дані для A.1
data_a1 = [
    ("<10", "Сталь", "T15K6", 0.09, 0.18),
    ("<10", "Сталь", "T5K10", 0.12, 0.18),
    ("<10", "Чавун та мідні сплави", "BK6", 0.14, 0.24),
    ("<10", "Чавун та мідні сплави", "BK8", 0.20, 0.29),
    (">10", "Сталь", "T15K6", 0.12, 0.18),
    (">10", "Сталь", "T5K10", 0.16, 0.24),
    (">10", "Чавун та мідні сплави", "BK6", 0.18, 0.28),
    (">10", "Чавун та мідні сплави", "BK8", 0.25, 0.38),
]

# Заповнення таблиці даними
cursor.executemany("""
INSERT INTO A1_feeds (machine_power, material, carbide_type, feed_min, feed_max)
VALUES (?, ?, ?, ?, ?)
""", data_a1)

# 🔢 Дані для A.2
data_a2 = [
    # До 5 кВт
    ("<5", "Великі", "Торцеві і дискові", "Сталь", 0.06, 0.07),
    ("<5", "Великі", "Торцеві і дискові", "Чавун та мідні сплави", 0.15, 0.30),
    ("<5", "Дрібні", "Торцеві і дискові", "Сталь", 0.04, 0.06),
    ("<5", "Дрібні", "Торцеві і дискові", "Чавун та мідні сплави", 0.12, 0.20),
    ("<5", "Великі", "Циліндрові", "Сталь", 0.08, 0.12),
    ("<5", "Великі", "Циліндрові", "Чавун та мідні сплави", 0.10, 0.18),
    ("<5", "Дрібні", "Циліндрові", "Сталь", 0.05, 0.08),
    ("<5", "Дрібні", "Циліндрові", "Чавун та мідні сплави", 0.06, 0.12),

    # 5–10 кВт
    ("5-10", "Великі", "Торцеві і дискові", "Сталь", 0.08, 0.15),
    ("5-10", "Великі", "Торцеві і дискові", "Чавун та мідні сплави", 0.20, 0.40),
    ("5-10", "Дрібні", "Торцеві і дискові", "Сталь", 0.06, 0.10),
    ("5-10", "Дрібні", "Торцеві і дискові", "Чавун та мідні сплави", 0.15, 0.30),
    ("5-10", "Великі", "Циліндрові", "Сталь", 0.12, 0.20),
    ("5-10", "Великі", "Циліндрові", "Чавун та мідні сплави", 0.20, 0.30),
    ("5-10", "Дрібні", "Циліндрові", "Сталь", 0.10, 0.15),
    ("5-10", "Дрібні", "Циліндрові", "Чавун та мідні сплави", 0.15, 0.25),

    # Більше 10 кВт
    (">10", "Великі", "Торцеві і дискові", "Сталь", 0.15, 0.25),
    (">10", "Великі", "Торцеві і дискові", "Чавун та мідні сплави", 0.30, 0.50),
    (">10", "Великі", "Циліндрові", "Сталь", 0.30, 0.40),
    (">10", "Великі", "Циліндрові", "Чавун та мідні сплави", 0.40, 0.60),
]

# Додавання в таблицю
cursor.executemany("""
INSERT INTO A2_feeds (machine_power, tooth_size, cutter_type, material, feed_min, feed_max)
VALUES (?, ?, ?, ?, ?, ?)
""", data_a2)

# 🔢 Дані для A.3
data_a3 = [
    # Торцеві і дискові фрези зі вставними ножами
    ("Торцеві і дискові", "Твердий сплав", None, None, 0.4, 1.2),
    ("Торцеві і дискові", "Швидкорізальна сталь", None, None, 0.23, 1.2),

    # Циліндрові фрези зі швидкорізальної сталі, конструкційна сталь
    ("Циліндрові фрези", None, "Конструкційна сталь", "40-75", 0.6, 2.7),
    ("Циліндрові фрези", None, "Конструкційна сталь", "90-130", 1.0, 3.8),
    ("Циліндрові фрези", None, "Конструкційна сталь", "150-200", 1.3, 5.0),

    # Циліндрові фрези зі швидкорізальної сталі, чавун, мідні та алюмінієві сплави
    ("Циліндрові фрези", None, "Чавун, мідні та алюмінієві сплави", "40-75", 0.6, 2.3),
    ("Циліндрові фрези", None, "Чавун, мідні та алюмінієві сплави", "90-130", 0.8, 3.0),
    ("Циліндрові фрези", None, "Чавун, мідні та алюмінієві сплави", "150-200", 1.1, 3.7),
]

# Додавання даних
cursor.executemany("""
INSERT INTO A3_finishing_feeds (cutter_type, tool_material, material, diameter_range, feed_min, feed_max)
VALUES (?, ?, ?, ?, ?, ?)
""", data_a3)

# ===== Таблиця A.4 — feeds_endmill_rough =====
data_a4 = [
    # Коронка
    ("Коронка", 10, 12, 0, 3, 0.01, 0.03),
    ("Коронка", 14, 16, 0, 3, 0.02, 0.06),
    ("Коронка", 14, 16, 3, 5, 0.02, 0.04),
    ("Коронка", 18, 22, 0, 3, 0.04, 0.07),
    ("Коронка", 18, 22, 3, 5, 0.03, 0.05),
    ("Коронка", 18, 22, 5, 8, 0.02, 0.04),

    # Гвинтові пластинки
    ("Гвинтові пластинки", 20, 20, 0, 3, 0.06, 0.10),
    ("Гвинтові пластинки", 20, 20, 3, 5, 0.05, 0.08),
    ("Гвинтові пластинки", 20, 20, 5, 8, 0.03, 0.05),

    ("Гвинтові пластинки", 25, 25, 0, 3, 0.08, 0.12),
    ("Гвинтові пластинки", 25, 25, 3, 5, 0.06, 0.10),
    ("Гвинтові пластинки", 25, 25, 5, 8, 0.05, 0.10),
    ("Гвинтові пластинки", 25, 25, 8, 12, 0.05, 0.08),

    ("Гвинтові пластинки", 30, 30, 0, 3, 0.10, 0.15),
    ("Гвинтові пластинки", 30, 30, 3, 5, 0.08, 0.12),
    ("Гвинтові пластинки", 30, 30, 5, 8, 0.06, 0.10),
    ("Гвинтові пластинки", 30, 30, 8, 12, 0.05, 0.09),
    ("Гвинтові пластинки", 30, 30, 12, 20, 0.04, 0.07),

    ("Гвинтові пластинки", 40, 40, 0, 3, 0.10, 0.18),
    ("Гвинтові пластинки", 40, 40, 3, 5, 0.08, 0.13),
    ("Гвинтові пластинки", 40, 40, 5, 8, 0.06, 0.11),
    ("Гвинтові пластинки", 40, 40, 8, 12, 0.05, 0.10),
    ("Гвинтові пластинки", 40, 40, 12, 20, 0.05, 0.09),

    ("Гвинтові пластинки", 50, 50, 0, 3, 0.10, 0.20),
    ("Гвинтові пластинки", 50, 50, 3, 5, 0.10, 0.15),
    ("Гвинтові пластинки", 50, 50, 5, 8, 0.08, 0.12),
    ("Гвинтові пластинки", 50, 50, 8, 12, 0.06, 0.10),
    ("Гвинтові пластинки", 50, 50, 12, 20, 0.06, 0.10),
]

# Додавання даних у таблицю
cursor.executemany("""
INSERT INTO A4_feeds (cutter_type, diameter_min, diameter_max, depth_min, depth_max, feed_min, feed_max)
VALUES (?, ?, ?, ?, ?, ?, ?)
""", data_a4)



# 🔢 Дані з таблиці A.5
data_a5 = [
    (10, 16, 0.02, 0.06),
    (20, 22, 0.06, 0.12),
    (25, 35, 0.12, 0.24),
    (40, 60, 0.30, 0.60),
]

# Додавання в базу
cursor.executemany("""
INSERT INTO A5_feeds (diameter_min, diameter_max, feed_min, feed_max)
VALUES (?, ?, ?, ?)
""", data_a5)

# ===== Таблиця A.6 — cutting_speed_coeffs_steel =====
data_a6 = [
    ("Сталь", None, "Торцеві", "Твердий сплав", "Фрезерування площин", None, None, None, 332, 0.25, 0.1, 0.2, 0.15, 0, 0.3),
    ("Сталь", None, "Торцеві", "Швидкорізальна сталь", "Фрезерування площин", None, "≤0.1", None, 64.7, 0.25, 0.1, 0.2, 0.15, 0, 0.3),
    ("Сталь", None, "Торцеві", "Швидкорізальна сталь", "Фрезерування площин", None, ">0.1", None, 41.0, 0.25, 0.1, 0.2, 0.1, 0, 0.33),
    ("Сталь", None, "Циліндрові", "Твердий сплав", "Фрезерування площин", "≤35", None, None, 390, 0.17, 0.19, 0.28, -0.05, 0.1, 0.33),
    ("Сталь", None, "Циліндрові", "Твердий сплав", "Фрезерування площин", ">35", None, None, 443, 0.17, 0.19, 0.38, -0.05, 0.1, 0.33),
    ("Сталь", None, "Циліндрові", "Швидкорізальна сталь", "Фрезерування площин", "≤2", None, None, 616, 0.17, 0.19, None, -0.08, 0.08, 0.33),
    ("Сталь", None, "Циліндрові", "Швидкорізальна сталь", "Фрезерування площин", ">2", None, None, 70, 0.38, None, None, None, None, 0.33),
    ("Сталь", None, "Дискові зі вставними ножами", "Твердий сплав", "Фрезерування площин", None, "<0.12", None, 1340, 0.2, 0.4, 0.12, 0, 0, 0.35),
    ("Сталь", None, "Дискові зі вставними ножами", "Твердий сплав", "Фрезерування площин", None, "≥0.12", None, 740, None, 0.4, None, 0, 0, 0.35),
    ("Сталь", None, "Дискові зі вставними ножами", "Швидкорізальна сталь", "Фрезерування пазів", None, "<0.06", None, 1825, 0.2, 0.3, 0.12, 0.1, 0, 0.35),
    ("Сталь", None, "Дискові зі вставними ножами", "Швидкорізальна сталь", "Фрезерування пазів", None, "≥0.06", None, 690, None, 0.4, None, 0, 0, 0.35),
    ("Сталь", None, "Дискові цільні", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, "≤0.1", None, 75.5, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Сталь", None, "Дискові цільні", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, ">0.1", None, 48.5, None, 0.4, None, 0.1, 0.1, 0.2),
    ("Сталь", None, "Кінцеві з коронками", "Твердий сплав", "Фрезерування площин, уступів і пазів", None, None, None, 68.5, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Сталь", None, "Кінцеві з напаяними пластинами", "Твердий сплав", "Фрезерування площин, уступів і пазів", None, None, None, 145, 0.44, 0.24, 0.26, 0.1, 0.13, 0.37),
    ("Сталь", None, "Кінцеві цільні", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, None, None, 234, 0.44, 0.24, 0.26, 0.1, 0.13, 0.37),
    ("Сталь", None, "Кінцеві цільні", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, None, None, 46.7, 0.45, 0.5, 0.5, 0.1, 0.1, 0.33),
    ("Сталь", None, "Прорізні і відрізні", "Швидкорізальна сталь", "Прорізання і відрізання", None, None, None, 53, 0.25, 0.3, 0.2, 0.2, 0.1, 0.2),
    ("Сталь", None, "Шпоночні двосторонні", "Швидкорізальна сталь", "Фрезерування шпоночних пазів", None, None, None, 12, 0.3, 0.3, 0.25, 0, 0, 0.26),
    ("Чавун", "HB<1500", "Торцеві", "Твердий сплав", "Фрезерування поверхонь", None, "≤0.18", None, 994, 0.22, 0.17, 0.1, 0.22, 0, 0.33),
    ("Чавун", "HB<1500", "Торцеві", "Твердий сплав", "Фрезерування поверхонь", None, ">0.18", None, 695, 0.22, 0.32, None, None, 0, 0.33),
    ("Чавун", "HB<1500", "Торцеві", "Швидкорізальна сталь", "Фрезерування поверхонь", None, "≤0.1", None, 90.5, 0.25, 0.1, 0.2, 0.15, 0.1, 0.2),
    ("Чавун", "HB<1500", "Торцеві", "Швидкорізальна сталь", "Фрезерування поверхонь", None, ">0.1", None, 57.4, 0.25, None, 0.4, None, 0.1, 0.2),
    ("Чавун", "HB<1500", "Циліндрові", "Швидкорізальна сталь", "Фрезерування поверхонь", None, "≤0.1", None, 77, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("Чавун", "HB<1500", "Циліндрові", "Швидкорізальна сталь", "Фрезерування поверхонь", None, ">0.1", None, 49.5, 0.45, None, 0.4, None, 0.1, 0.33),
    ("Чавун", "HB<1500", "Дискові цільні", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, None, None, 95.8, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("Чавун", "HB<1500", "Кінцеві", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, None, None, 68.5, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("Чавун", "HB<1500", "Прорізні і відрізні", "Швидкорізальна сталь", "Прорізання пазів і відрізання", None, None, None, 74, 0.25, 0.3, 0.2, 0.2, 0.1, 0.2),
    ("Чавун", "HB>1500", "Торцеві", "Твердий сплав", "Фрезерування поверхонь", None, None, None, 445, 0.2, 0.15, 0.35, 0.2, 0, 0.32),
    ("Чавун", "HB>1500", "Торцеві", "Швидкорізальна сталь", "Фрезерування поверхонь", None, None, None, 42, 0.2, 0.1, 0.4, 0.1, 0.1, 0.15),
    ("Чавун", "HB>1500", "Циліндрові", "Твердий сплав", "Фрезерування поверхонь", None, "<2.5", "≤0.2", 923, 0.37, 0.13, 0.19, 0.23, 0.14, 0.42),
    ("Чавун", "HB>1500", "Циліндрові", "Твердий сплав", "Фрезерування поверхонь", None, "<2.5", ">0.2", 588, 0.47, None, None, None, None, 0.42),
    ("Чавун", "HB>1500", "Циліндрові", "Твердий сплав", "Фрезерування поверхонь", None, "≥2.5", "≤0.2", 1180, 0.37, 0.4, 0.19, None, None, 0.42),
    ("Чавун", "HB>1500", "Циліндрові", "Твердий сплав", "Фрезерування поверхонь", None, "≥2.5", ">0.2", 750, 0.47, None, None, None, None, 0.42),
    ("Чавун", "HB>1500", "Дискові цільні", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, "≤0.15", None, 56.7, 0.7, 0.5, 0.2, 0.3, 0.3, 0.25),
    ("Чавун", "HB>1500", "Дискові цільні", "Швидкорізальна сталь", "Фрезерування площин і пазів", None, ">0.15", None, 27, 0.6, None, None, None, None, 0.15),
    ("Чавун", "HB>1500", "Кінцеві", "Швидкорізальна сталь", "Фрезерування площин і уступів", None, None, None, 72, 0.2, 0.5, 0.4, 0.1, 0.1, 0.15),
    ("Чавун", "HB>1500", "Прорізні і відрізні", "Швидкорізальна сталь", "Фрезерування і відрізання", None, None, None, 30, 0.2, 0.5, 0.4, 0.2, 0.1, 0.15),

]

# Додавання в таблицю
cursor.executemany("""
INSERT INTO A6_cutting_speeds (
    material_type, hardness, cutter_type, tool_material, operation,
    B, t, s, Cv, q, x, y, u, p, m
) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
""", data_a6)


# 🔢 Дані з таблиці A.7 (cutting_speed_coeffs_cu_al)
data_a7 = [
    ("торцева", "мідні", "≤0,1", 136, 0.25, 0.1, 0.2, 0.15, 0.1, 0.2),
    ("торцева", "мідні", ">0,1", 86.2, 0.25, 0.1, 0.4, 0.15, 0.1, 0.2),
    ("торцева", "алюмінієві", "≤0,1", 245, 0.25, 0.1, 0.2, 0.15, 0.1, 0.2),
    ("торцева", "алюмінієві", ">0,1", 155, 0.25, 0.1, 0.4, 0.15, 0.1, 0.2),
    ("циліндрична", "мідні", "≤0,1", 115.5, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("циліндрична", "мідні", ">0,1", 74.3, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("циліндрична", "алюмінієві", "≤0,1", 208, 0.45, 0.3, 0.4, 0.1, 0.1, 0.33),
    ("циліндрична", "алюмінієві", ">0,1", 133.5, 0.45, 0.3, 0.4, 0.1, 0.1, 0.33),
    ("дискова", "мідні", "-", 144, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("дискова", "алюмінієві", "-", 259, 0.25, 0.3, 0.2, 0.1, 0.1, 0.2),
    ("кінцева", "мідні", "-", 103, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("кінцева", "алюмінієві", "-", 185.5, 0.45, 0.3, 0.2, 0.1, 0.1, 0.33),
    ("прорізна", "мідні", "-", 111.3, 0.25, 0.3, 0.2, 0.2, 0.1, 0.2),
    ("прорізна", "алюмінієві", "-", 200, 0.25, 0.3, 0.2, 0.2, 0.1, 0.2),
]

cursor.executemany("""
INSERT INTO cutting_speed_coeffs_cu_al (
    tool_type, material, sz, Cv, q, x, y, u, p, m)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
""", [(r[0], r[1], r[2], r[3], r[4], r[5], r[6], r[7], r[8], r[9]) for r in data_a7])


# ===== Таблиця A.8 — tool_life =====
data_a8 = [
    ("торцева", 40, 120),
    ("торцева", 60, 180),
    ("торцева", 75, 180),
    ("торцева", 90, 180),
    ("торцева", 110, 180),
    ("торцева", 150, 180),
    ("торцева", 200, 240),
    ("торцева", 250, 240),
    ("торцева", 300, 300),
    ("торцева", 400, 400),
    ("циліндрична", 90, 180),
    ("циліндрична", 110, 180),
    ("циліндрична", 150, 180),
    ("циліндрична", 200, 240),
    ("циліндрична з малим зубом", 40, 120),
    ("циліндрична з малим зубом", 60, 120),
    ("циліндрична з малим зубом", 75, 180),
    ("циліндрична з малим зубом", 90, 180),
    ("дискова", 90, 120),
    ("дискова", 110, 120),
    ("дискова", 150, 150),
    ("дискова", 200, 180),
    ("дискова", 250, 240),
    ("кінцева", 20, 80),
    ("кінцева", 25, 90),
    ("кінцева", 40, 120),
    ("кінцева", 60, 180),
    ("прорізна", 75, 60),
    ("прорізна", 90, 75),
    ("прорізна", 60, 120),
    ("прорізна", 110, 120),
    ("прорізна", 150, 120),
    ("прорізна", 200, 150),
    ("фасонна", 40, 120),
    ("фасонна", 60, 120),
    ("фасонна", 75, 120),
    ("фасонна", 90, 180),
]

cursor.executemany("""
INSERT INTO tool_life (tool_type, diameter, life_minutes)
VALUES (?, ?, ?)
""", data_a8)

# ===== Таблиця A.9 — power_exponents_nv =====
data_a9 = [
    ("Сталь (C<0.6%)", "Oa < 450", -0.9, 1.0),
    ("Сталь (C<0.6%)", "Oa = 450 - 550", -0.9, 1.0),
    ("Сталь (C<0.6%)", "Oa > 550", 0.9, 1.0),
    ("Сталь (C>0.6%)", None, 1.35, 1.0),
    ("Сталь (C>0.6%)", "хромонікелева", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромомарганцевиста", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромокремниста", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромокремнемарганцевиста", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромонікельмолібденова", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромованадієва", 1.0, 1.0),
    ("Сталь (C>0.6%)", "марганцевиста", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромонікельванадієва", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромомолібденова", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромоалюмінієва", 1.0, 1.0),
    ("Сталь (C>0.6%)", "хромонікельванадієва", 1.0, 1.0),
    ("Чавун", "сірий", 0.95, 1.25),
    ("Чавун", "ковкий", 0.85, 1.25),
]

cursor.executemany("""
INSERT INTO A9_speed_exponents (
    material, condition, milling_hss, milling_carbide
) VALUES (?, ?, ?, ?)
""", data_a9)

# Дані A.10
data_a10 = [
    ("Без кірки", None, 1.0, 1.0),
    ("З кіркою", "Прокат", 0.9, 0.9),
    ("З кіркою", "Поковка", 0.8, 0.8),
    ("З кіркою", "Сталь чавун відливання (нормальний стан)", 0.8, 0.85),
    ("З кіркою", "Сталь чавун відливання (забруднений стан)", 0.5, 0.6),
    ("З кіркою", "Мідні й алюмінієві сплави", 0.9, 0.9)
]

cursor.executemany("""
INSERT INTO A10_surface_correction (surface_condition, material, Ksh_min, Ksh_max
) VALUES (?, ?, ?, ?)
""", data_a10)

# Дані A.11
data_a11 = [
    ("сталь конструкційна", "Т5К12В", 0.75),
    ("сталь конструкційна", "Т5К10", 0.65),
    ("сталь конструкційна", "Р18", 0.80),
    ("сталь конструкційна", "Т15К6", 1.05),
    ("сталь конструкційна", "Р6М5", 1.15),
    ("сталь конструкційна", "Т30К4", 1.40),
    ("сталь конструкційна", "ВК8", 0.40),
    ("сталь загартована HRC 35-50", "T15K6", 1.0),
    ("сталь загартована HRC 35-50", "T30K4", 1.25),
    ("сталь загартована HRC 35-50", "BK6", 0.85),
    ("сталь загартована HRC 35-50", "BK8", 0.83),
    ("сталь загартована HRC 51-62", "BK4", 1.0),
    ("сталь загартована HRC 51-62", "BK6", 0.92),
    ("сталь загартована HRC 51-62", "BK8", 0.74),
    ("сірий/ковкий чавун", "ВК8", 0.83),
    ("сірий/ковкий чавун", "ВК6", 1.0),
    ("сірий/ковкий чавун", "ВК4", 1.10),
    ("сірий/ковкий чавун", "ВК3", 1.15),
    ("сірий/ковкий чавун", "Р18", 0.95),
    ("сірий/ковкий чавун", "Р6М3", 0.90),
    ("мідні/алюмінієві сплави", "Р6М5", 1.0),
    ("мідні/алюмінієві сплави", "ВК4", 2.5),
    ("мідні/алюмінієві сплави", "ВК6", 2.7),
    ("мідні/алюмінієві сплави", "9ХС", 0.6),
    ("мідні/алюмінієві сплави", "ХВГ", 0.6),
    ("мідні/алюмінієві сплави", "У12А", 0.5),
]

cursor.executemany("""
INSERT INTO tool_material_coeffs (workpiece_material, tool_material, coeff)
VALUES (?, ?, ?)
""", data_a11)

# Дані A.12
data_a12 = [
    ("6М81Г", "Горизонтальний", "250×1000", 18, 40, 2000, 18, 20, 1000, 6.5, 333, 1200, 4.0, 0.80),
    ("6Н81Г", "Горизонтальний", "250×1000", 16, 65, 1800, 16, 35, 980, 25, 765, 1200, 4.5, 0.80),
    ("6М82Г", "Горизонтальний", "350×1250", 18, 31, 1600, 18, 25, 1250, 8.3, 416, 1500, 7.5, 0.75),
    ("6Р83", "Горизонтальний", "400×1600", 18, 31.5, 1600, 18, 25, 1250, 25, 1250, 1600, 11.0, 0.75),
    ("6М12П", "Вертикальний", "320×1250", 18, 31, 1600, 18, 25, 1250, 15.6, 785, 1600, 7.5, 0.75),
    ("6М12ПБ", "Вертикальний", "320×1250", 18, 50, 2500, 18, 40, 2000, 27, 1330, 1600, 10.5, 0.75),
    ("6П11", "Вертикальний", "250×1000", 16, 50, 1600, 16, 35, 1020, 35, 1020, 1500, 5.5, 0.75),
    ("6П10", "Вертикальний", "160×630", 12, 50, 2240, 12, 25, 1120, 25, 1120, 1200, 3.0, 0.75),
]

cursor.executemany('''
INSERT INTO A12_milling_machines (
    model, type, table_size, spindle_speed_steps,
    spindle_speed_min, spindle_speed_max, feed_steps,
    longitudinal_feed_min, longitudinal_feed_max,
    cross_feed_min, cross_feed_max,
    feed_force, motor_power, efficiency
) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
''', data_a12)

conn.commit()
conn.close()
